In [1]:
import numpy as np
import pandas as pd

In [17]:
employee = pd.DataFrame(
    {
        'name':['Satish' , 'Ramya' , 'Teja', 'Bhavishya'],
        'emp_id': ['123', '124', '125','126'],
        'joining_date': ['2007-06-02', '2011-08-04', '2012-10-07' , '2015-05-15'],
    }
)
employee

        name emp_id joining_date
0     Satish    123   2007-06-02
1      Ramya    124   2011-08-04
2       Teja    125   2012-10-07
3  Bhavishya    126   2015-05-15

In [18]:
employee.dtypes

name            object
emp_id          object
joining_date    object
dtype: object

## Add new column by changing the datatype of the column to Datetime

In [19]:
employee['joining_dt']=pd.to_datetime(employee['joining_date']) 
employee

        name emp_id joining_date joining_dt
0     Satish    123   2007-06-02 2007-06-02
1      Ramya    124   2011-08-04 2011-08-04
2       Teja    125   2012-10-07 2012-10-07
3  Bhavishya    126   2015-05-15 2015-05-15

In [8]:
employee.dtypes

name                    object
emp_id                  object
joining_date            object
joining_dt      datetime64[ns]
dtype: object

## Changing Datetime format

In [20]:
employee['JD_yyyymmdd'] = pd.to_datetime(employee['joining_dt']).dt.strftime('%Y%m%d')
employee

        name emp_id joining_date joining_dt JD_yyyymmdd
0     Satish    123   2007-06-02 2007-06-02    20070602
1      Ramya    124   2011-08-04 2011-08-04    20110804
2       Teja    125   2012-10-07 2012-10-07    20121007
3  Bhavishya    126   2015-05-15 2015-05-15    20150515

In [21]:
employee.dtypes

name                    object
emp_id                  object
joining_date            object
joining_dt      datetime64[ns]
JD_yyyymmdd             object
dtype: object

Note : This will change the datatype back to object

## Extract Month, Day, Year, 'Day of Week' and 'Week of Year'

In [12]:
employee['Month'] = employee.joining_dt.dt.month
employee['Day'] = employee.joining_dt.dt.day
employee['Year'] = employee.joining_dt.dt.year

employee['Week Number'] = employee.joining_dt.dt.isocalendar().week
employee['Day Of Week'] = employee.joining_dt.dt.dayofweek

employee['Day Name'] = pd.to_datetime(employee['joining_dt']).dt.day_name()
employee['Month Name'] = pd.to_datetime(employee['joining_dt']).dt.month_name()

In [13]:
employee

,name,emp_id,joining_date,joining_dt,Month,Day,Year,Week Number,Day Of Week,Day Name,Month Name
0,Satish,123,2007-06-02,2007-06-02,6,2,2007,22,5,Saturday,June
1,Ramya,124,2011-08-04,2011-08-04,8,4,2011,31,3,Thursday,August
2,Teja,125,2012-10-07,2012-10-07,10,7,2012,40,6,Sunday,October
3,Bhavishya,126,2015-05-15,2015-05-15,5,15,2015,20,4,Friday,May

In [14]:
employee.dtypes

name                    object
emp_id                  object
joining_date            object
joining_dt      datetime64[ns]
Month                    int64
Day                      int64
Year                     int64
Week Number             UInt32
Day Of Week              int64
Day Name                object
Month Name              object
dtype: object

## Apply filter conditions

In [22]:
# Find employees who are joined after 2010-01-01
from datetime import date
employee[pd.to_datetime(employee['joining_dt']) > pd.Timestamp(date(2010,1,1))]

        name emp_id joining_date joining_dt JD_yyyymmdd
1      Ramya    124   2011-08-04 2011-08-04    20110804
2       Teja    125   2012-10-07 2012-10-07    20121007
3  Bhavishya    126   2015-05-15 2015-05-15    20150515

In [24]:
# Find employees who joined in between "2011-04-01" and "2012-04-01"
employee[
    (pd.to_datetime(employee['joining_dt']) > pd.Timestamp(date(2011,4,1))) &
    (pd.to_datetime(employee['joining_dt']) < pd.Timestamp(date(2012,4,1)))
]

    name emp_id joining_date joining_dt JD_yyyymmdd
1  Ramya    124   2011-08-04 2011-08-04    20110804